Revit 2024 API
FamilyParameter.GUID Property
The globally unique identifier
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Guid GUID { get; }
Visual Basic
Public ReadOnly Property GUID As Guid
	Get
Visual C++
public:
property Guid GUID {
	Guid get ();
}
Examples
CopyC#
foreach (FamilyParameter familyParam in familyDoc.FamilyManager.Parameters)
{
    string familyParamName = familyParam.Definition.Name;
    try
    {
        Guid guid = familyParam.GUID;
        TaskDialog.Show("Revit",familyParamName + " is shared. Guid is " + guid);
    }
    catch (System.Exception)
    {
        TaskDialog.Show("Revit",familyParamName + " is NOT shared");
    }
}
CopyVB.NET
For Each familyParam As FamilyParameter In familyDoc.FamilyManager.Parameters
    Dim familyParamName As String = familyParam.Definition.Name
    Try
        Dim guid As Guid = familyParam.GUID
        TaskDialog.Show("Revit", familyParamName & " is shared. Guid is " & Convert.ToString(guid))
    Catch generatedExceptionName As System.Exception
        TaskDialog.Show("Revit", familyParamName & " is NOT shared")
    End Try
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when the parameter is not a shared parameter.
See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace